<template>
  <!-- <div>24242 {{ message }}</div> -->
  <!-- <pre>{{ SampleYear }}</pre> -->
  <!-- <pre>{{ SearchKeyword }}</pre> -->
  
  <a-form @submit="onSubmit" style="width: 500px; margin: auto">
    <a-row :gutter="16">
      <a-col :span="7">
        <a-form-item label="年份" name="Year">
          <a-input-number v-model:value="SampleYear" />
        </a-form-item>
      </a-col>
      <a-col :span="11">
        <a-form-item label="地區" name="Keyword">
          <a-input v-model:value="SearchKeyword" />
        </a-form-item>
      </a-col>
      <a-col :span="6">
        <a-form-item>
          <a-button type="primary" html-type="submit">查詢</a-button>
        </a-form-item>
      </a-col>
    </a-row>
  </a-form>
  <WaterChart v-if="message.length" title="濁度(NTU)" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="色度(鉑鈷單位)" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="臭度(初嗅數)" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="pH值" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="自由有效餘氯mg/L" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="大腸桿菌群(CFU/100毫升)" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="總菌落數(CFU/毫升)" :message="message"></WaterChart>
  <WaterChart v-if="message.length" title="水溫(℃)" :message="message"></WaterChart>
  <div v-else style="text-align: center;">{{ status }}</div>
  <!-- <div>-------------------------</div>
  <pre>{{ message }}</pre>
  <div>-------------------------</div> -->
</template>

<script>
import backendAPI from "./../utility/backendAPI";
import WaterChart from "./WaterChart.vue";

export default {
  name: "WaterGraph",
  components: {
    WaterChart,
  },
  data() {
    return {
      status: '',
      message: [],
      SearchKeyword: "仁德",
      SampleYear: 2021,
    };
  },
  methods: {
    onSubmit() {
      this.fetchWaterQuality({
        SearchKeyword: this.SearchKeyword,
        SampleYear: this.SampleYear,
      });
    },
    async fetchWaterQuality({ SearchKeyword, SampleYear }) {
      this.status = '查詢中...'
      await Promise.all(
        Array(12)
          .fill(1)
          .map((o, i) => o + i)
          .map(async (SampleMonth) => {
            const res = await backendAPI.promiseGET("/water-quality", {
              SearchKeyword,
              SampleYear,
              SampleMonth,
            });
            this.status = ''
            this.message = [...this.message, ...res.data];
          })
      );
    },
  },
  // computed: {
  //   message() {
  //     return [
  //       {
  //         title: "台南仁德區 | 2021年05月25日",
  //         data: {
  //           value: {
  //             取樣地點: "102",
  //             "濁度(NTU)": "0.20",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.6",
  //             "自由有效餘氯mg/L": "0.32",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "30.2",
  //             備註: "仁德區二行一路147號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年05月25日",
  //         data: {
  //           value: {
  //             取樣地點: "103",
  //             "濁度(NTU)": "0.20",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.8",
  //             "自由有效餘氯mg/L": "0.31",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "12",
  //             "水溫(℃)": "30.8",
  //             備註: "仁德區保安里中正路1段258號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年05月25日",
  //         data: {
  //           value: {
  //             取樣地點: "104",
  //             "濁度(NTU)": "0.35",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.6",
  //             "自由有效餘氯mg/L": "0.36",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "8",
  //             "水溫(℃)": "30.0",
  //             備註: "仁德區保安里中正路2段932號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年05月25日",
  //         data: {
  //           value: {
  //             取樣地點: "105",
  //             "濁度(NTU)": "0.25",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.5",
  //             "自由有效餘氯mg/L": "0.30",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "30.2",
  //             備註: "仁德區中山路475號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年05月03日",
  //         data: {
  //           value: {
  //             取樣地點: "103",
  //             "濁度(NTU)": "0.15",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.8",
  //             "自由有效餘氯mg/L": "0.38",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "27.4",
  //             備註: "環保監測點\n仁德區保安里中正路1段258號\n廠所自行採樣",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年01月18日",
  //         data: {
  //           value: {
  //             取樣地點: "102",
  //             "濁度(NTU)": "0.35",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.7",
  //             "自由有效餘氯mg/L": "0.54",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "20.0",
  //             備註: "仁德區二行一路147號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年01月18日",
  //         data: {
  //           value: {
  //             取樣地點: "103",
  //             "濁度(NTU)": "0.25",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.7",
  //             "自由有效餘氯mg/L": "0.53",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "19.0",
  //             備註: "仁德區保安里中正路1段258號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年01月18日",
  //         data: {
  //           value: {
  //             取樣地點: "104",
  //             "濁度(NTU)": "0.15",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.2",
  //             "自由有效餘氯mg/L": "0.53",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "20.8",
  //             備註: "仁德區保安里中正路2段932號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年01月18日",
  //         data: {
  //           value: {
  //             取樣地點: "105",
  //             "濁度(NTU)": "0.20",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.2",
  //             "自由有效餘氯mg/L": "0.47",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "20.2",
  //             備註: "仁德區中山路475號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年01月13日",
  //         data: {
  //           value: {
  //             取樣地點: "103",
  //             "濁度(NTU)": "0.20",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "7.9",
  //             "自由有效餘氯mg/L": "0.53",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "18.8",
  //             備註: "環保監測點仁德區保安里中正路1段258號廠所自行採樣",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年03月22日",
  //         data: {
  //           value: {
  //             取樣地點: "102",
  //             "濁度(NTU)": "0.35",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.0",
  //             "自由有效餘氯mg/L": "0.39",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "22.6",
  //             備註: "仁德區二行一路147號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年03月22日",
  //         data: {
  //           value: {
  //             取樣地點: "103",
  //             "濁度(NTU)": "0.45",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.2",
  //             "自由有效餘氯mg/L": "0.31",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "22.5",
  //             備註: "仁德區保安里中正路1段258號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年03月22日",
  //         data: {
  //           value: {
  //             取樣地點: "104",
  //             "濁度(NTU)": "0.40",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.0",
  //             "自由有效餘氯mg/L": "0.47",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "21.8",
  //             備註: "仁德區保安里中正路2段932號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年03月22日",
  //         data: {
  //           value: {
  //             取樣地點: "105",
  //             "濁度(NTU)": "0.20",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.0",
  //             "自由有效餘氯mg/L": "0.30",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "24.6",
  //             備註: "仁德區中山路475號",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //       {
  //         title: "台南仁德區 | 2021年03月10日",
  //         data: {
  //           value: {
  //             取樣地點: "103",
  //             "濁度(NTU)": "0.70",
  //             "色度(鉑鈷單位)": "<5",
  //             "臭度(初嗅數)": "無",
  //             pH值: "8.0",
  //             "自由有效餘氯mg/L": "0.47",
  //             "大腸桿菌群(CFU/100毫升)": "<1",
  //             "總菌落數(CFU/毫升)": "<1",
  //             "水溫(℃)": "23.6",
  //             備註: "環保監測點\n仁德區保安里中正路1段258號\n廠所自行採樣",
  //           },
  //           spec: {
  //             取樣地點: "編號",
  //             "濁度(NTU)": "2",
  //             "色度(鉑鈷單位)": "5",
  //             "臭度(初嗅數)": "3",
  //             pH值: "6.0-8.5",
  //             "自由有效餘氯mg/L": "0.2-1.0",
  //             "大腸桿菌群(CFU/100毫升)": "6",
  //             "總菌落數(CFU/毫升)": "100",
  //             "水溫(℃)": "--",
  //             備註: "地點",
  //           },
  //         },
  //       },
  //     ];
  //   },
  // }
};
</script>

<style lang="scss" scoped>
</style>